WSDL/Producao/PNovaLimaMG-recepcionarloterps.wsdl

<?xml version="1.0" encoding="utf-8"?>
<definitions name="A24_RecepcionarLoteRps" targetNamespace="http://www.e-nfs.com.br" xmlns:wsdlns="http://www.e-nfs.com.br" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="http://www.e-nfs.com.br">
	<types>
		<schema targetNamespace="http://www.e-nfs.com.br" xmlns="http://www.w3.org/2001/XMLSchema" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" elementFormDefault="qualified">
			<element name="A24_RecepcionarLoteRps.Execute">
				<complexType>
					<sequence>
						<element minOccurs="1" maxOccurs="1" name="Nfsecabecmsg" type="xsd:string"/>
						<element minOccurs="1" maxOccurs="1" name="Nfsedadosmsg" type="xsd:string"/>
					</sequence>
				</complexType>
			</element>
			<element name="A24_RecepcionarLoteRps.ExecuteResponse">
				<complexType>
					<sequence>
						<element minOccurs="1" maxOccurs="1" name="Outputxml" type="xsd:string"/>
					</sequence>
				</complexType>
			</element>
		</schema>
	</types>
	<message name="A24_RecepcionarLoteRps.ExecuteSoapIn">
		<part name="parameters" element="tns:A24_RecepcionarLoteRps.Execute"/>
	</message>
	<message name="A24_RecepcionarLoteRps.ExecuteSoapOut">
		<part name="parameters" element="tns:A24_RecepcionarLoteRps.ExecuteResponse"/>
	</message>
	<portType name="A24_RecepcionarLoteRpsSoapPort">
		<operation name="Execute">
			<input message="wsdlns:A24_RecepcionarLoteRps.ExecuteSoapIn"/>
			<output message="wsdlns:A24_RecepcionarLoteRps.ExecuteSoapOut"/>
		</operation>
	</portType>
	<binding name="A24_RecepcionarLoteRpsSoapBinding" type="wsdlns:A24_RecepcionarLoteRpsSoapPort">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<operation name="Execute">
			<soap:operation soapAction="http://www.e-nfs.com.braction/AA24_RECEPCIONARLOTERPS.Execute"/>
			<input>
				<soap:body use="literal"/>
			</input>
			<output>
				<soap:body use="literal"/>
			</output>
		</operation>
	</binding>
	<service name="A24_RecepcionarLoteRps">
		<port name="A24_RecepcionarLoteRpsSoapPort" binding="wsdlns:A24_RecepcionarLoteRpsSoapBinding">
			<soap:address location="https://enfs-hom.abaco.com.br/novalima/servlet/aa24_recepcionarloterps"/>
		</port>
	</service>
</definitions>
